Repository: autotrace/autotrace
Catalog: po/*.po
Languages: de

source: Input and output file may not be the same
de: Ein- und Ausgabedatei dürfen nicht identisch sein

source: Not a valid input file name %s
de: Kein gültiger Eingabedateiname %s

source: Default format %s is not supported
de: Standardformat %s wird nicht unterstützt

source: Unsupported input format
de: Nicht unterstütztes Eingabeformat

source: background-color should be six chars long
de: background-color sollte sechs Zeichen lang sein

source: Usage: %s [options] <input_file_name>.
de: Verwendung: %s [Optionen] <Eingabedateiname>.

source: You can get the source code of autotrace from %s
de: Sie können den Sourcecode bekommen von %s

source: Input format %s is not supported
de: Eingabeformat %s wird nicht unterstützt

source: Supported output formats:
de: Unterstützte Ausgabeformate:

source: Supported input formats:
de: Unterstützte Ausgabeformate:

source: Output format %s is not supported
de: Ausgabeformat %s wird nicht unterstützt

source: Wrong type of msg
de: Falscher msg Typ

source: background-color <hexadezimal>: the color of the background that should be ignored, for example FFFFFF; default is no background color.
de: background-color <hexadezimal>: die Farbe des Hintergrundes, der ignoriert werden sollte, z. B. FFFFFF; Standard ist keine Hintergrundfarbe.

source: color-count <unsigned>: number of colors a color bitmap is reduced to, it does not work on grayscale, allowed are 1..256; default is 0, that means not color reduction is done.
de: color-count <vorzeichenlos>: Anzahl der Farben, auf die das Bitmap reduziert werden soll, funktioniert nicht für Graustufen, erlaubt sind 1..256; Standard ist 0, d. h. keine Farbreduktion wird durchgeführt.

source: corner-always-threshold <angle-in-degrees>: if the angle at a pixel is less than this, it is considered a corner, even if it is within `corner-surround' pixels of another corner; default is 60.
de: corner-always-threshold <Winkel in Grad>: wenn der Winkel an einem Punkt weniger ist als dieser, wird er als Ecke betrachtet, auch wenn er innerhalb `corner-surround' Punkte einer anderen Ecke ist; Standard ist 60.

source: corner-surround <unsigned>: number of pixels on either side of a point to consider when determining if that point is a corner; default is 4.
de: corner-surround <vorzeichenlos>: Anzahl der Punkte auf beiden Seiten eines Punktes, um festzustellen, ob der Punkt eine Ecke darstellt. Standard ist 4.

source: corner-threshold <angle-in-degrees>: if a pixel, its predecessor(s), and its successor(s) meet at an angle smaller than this, it's a corner; default is 100.
de: corner-threshold <Winkel in Grad>: wenn ein Punkt, sein(e) Vorgänger und Nachfolger sich in einem Winkel kleiner als dies treffen, ist es eine Ecke. Standard ist 100.

source: error-threshold <real>: subdivide fitted curves that are off by more pixels than this; default is 2.0.
de: error-threshold <Gleitkomma>: teile Kurven auf, die mehr als dieser Wert an an Punkten entfernt ist; Standard ist 2.0.

source: filter-iterations <unsigned>: smooth the curve this many times before fitting; default is 4.
de: filter-iterations <vorzeichenlos>: glätte die Kurve so viele Male vor dem Fitten; Standard ist 4.

source: line-reversion-threshold <real>: if a spline is closer to a straight line than this, weighted by the square of the curve length, keep it a straight line even if it is a list with curves; default is .01.
de: line-reversion-threshold <Gleitkomma>: wenn ein Spline mehr einer geraden Linie entspricht als dies gewichtet mit dem Quadrat der Kurvenlänge betrachte es als gerade, auch wenn es in einer Liste von Kurven ist; Standard ist 0.01.

source: line-threshold <real>: if the spline is not more than this far away from the straight line defined by its endpoints,then output a straight line; default is 1.
de: line-threshold <Gleitkomma>: wenn ein Spline nicht mehr als dieser Wert von einer geraden Linie, die durch die Endpunkte definiert ist, entfernt ist dann gebe eine gerade Linie aus; Standard ist 1.

source: remove-adjacent-corners: remove corners that are adjacent; default doesn't remove.
de: remove-adjacent-corners: entferne nebeneinanderliegende Ecken; Standard ist keine Entfernung.

source: tangent-surround <unsigned>: number of points on either side of a point to consider when computing the tangent at that point; default is 3.
de: tangent-surround <vorzeichenlos>: Zahl der Punkte auf jeder Seite eines Punktes, um die Tangente an diesem Punkt zu berechnen. Standard ist 3.

source: despeckle-level <unsigned>: 0..20; default is no despeckling.
de: despeckle-level <vorzeichenlos>: 0..20; Standard ist kein Despeckling.

source: despeckle-tightness <real>: 0.0..8.0; default is 2.0.
de: despeckle-tightness <Gleitkomma>: 0.0..8.0; Standard ist 2.0.

source: centerline: trace a character's centerline, rather than its outline.
de: centerline: Zeichne die Mittellinie nach statt der äußeren Kontur.

source: preserve-width: whether to preserve linewith with centerline fitting; default doesn't preserve.
de: preserve-width: of die Liniendicke erhalten werden soll; Standard ist die Nichterhaltung.

source: width-weight-factor <real>: weight factor for fitting the linewidth.
de: width-weight-factor <Gleitkomma>: Wichtungsfaktor zum Fitten der Liniendicke.
